app/Controllers/AuthAdmin.php

    public function prosesLogin()
    {
    	$email = $this->request->getVar('email');
    	$password = $this->request->getVar('password');

    	$checkEmail = $this->m_AuthAdmin->where('email_user', $email)->first();
---
SELECT *
FROM `user`
WHERE `email_user` = 'admin@admin.ac.id'
 LIMIT 1