app/Controllers/Auth.php

SELECT *
FROM `mahasiswa`
WHERE `npm_mhs` = '20081010032'
 LIMIT 1
---
    public function prosesLogin()
    {
    	$npm = $this->request->getVar('npm_mhs');
    	$password = $this->request->getVar('password');

    	$checkNpm = $this->m_Mahasiswa->where('npm_mhs', $npm)->first();