app/Controllers/Mahasiswa.php

	public function dashboard()
	{
		$data = [
			'title' => 'Dashboard Mahasiswa',
			'user' => $this->m_Mahasiswa->where('npm_mhs', session()->get('npm'))->first(),
---
SELECT *
FROM `mahasiswa`
WHERE `npm_mhs` = '20081010032'
 LIMIT 1

	public function listMahasiswa()
	{
		$data = [
			'title' => 'Mahasiswa',
			'datamahasiswa' => $this->m_Mahasiswa->findAll(),
---
SELECT *
FROM `mahasiswa`