app/Models/m_Total.php

SELECT COUNT(*) AS `numrows` FROM `mahasiswa`
---
	public function totalmahasiswa()
	{
		$this->db->table('mahasiswa')->countAll();

SELECT COUNT(*) AS `numrows` FROM `jurusan`
---
	public function totaljurusan()
	{
		$this->db->table('jurusan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `fakultas`
---
	public function totalfakultas()
	{
		$this->db->table('fakultas')->countAll();

SELECT COUNT(*) AS `numrows` FROM `matkul`
---
	public function totalmatkul()
	{
		$this->db->table('matkul')->countAll();

SELECT COUNT(*) AS `numrows` FROM `user`
---
	public function totaluser()
	{
		$this->db->table('user')->countAll();